Masmiseim36/nxpSDK/boards/frdmkl46z/project_template/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSB
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSB(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSegment_LCD:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '61', peripheral: LCD, signal: 'P, 11', pin_signal: LCD_P11/PTB11/SPI1_SCK/LCD_P11_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '60', peripheral: LCD, signal: 'P, 10', pin_signal: LCD_P10/PTB10/SPI1_PCS0/LCD_P10_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '92', peripheral: LCD, signal: 'P, 38', pin_signal: LCD_P38/PTC18/LCD_P38_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '6', peripheral: LCD, signal: 'P, 53', pin_signal: LCD_P53/PTE5/LCD_P53_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '58', peripheral: LCD, signal: 'P, 8', pin_signal: LCD_P8/PTB8/SPI1_PCS0/EXTRG_IN/LCD_P8_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '57', peripheral: LCD, signal: 'P, 7', pin_signal: LCD_P7/PTB7/LCD_P7_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '67', peripheral: LCD, signal: 'P, 17', pin_signal: LCD_P17/PTB21/LCD_P17_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '91', peripheral: LCD, signal: 'P, 37', pin_signal: LCD_P37/PTC17/LCD_P37_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '68', peripheral: LCD, signal: 'P, 18', pin_signal: LCD_P18/PTB22/LCD_P18_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '69', peripheral: LCD, signal: 'P, 19', pin_signal: LCD_P19/PTB23/LCD_P19_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '5', peripheral: LCD, signal: 'P, 52', pin_signal: LCD_P52/PTE4/SPI1_PCS0/LCD_P52_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
  - {pin_num: '93', peripheral: LCD, signal: 'P, 40', pin_signal: LCD_P40/PTD0/SPI0_PCS0/TPM0_CH0/LCD_P40_Fault, slew_rate: slow, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSegment_LCD
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSegment_LCD(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    const port_pin_config_t LCD_11 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P10 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTB10 (pin 60) is configured as LCD_P10 */
    PORT_SetPinConfig(BOARD_LCD_11_PORT, BOARD_LCD_11_PIN, &LCD_11);

    const port_pin_config_t LCD_12 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P11 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTB11 (pin 61) is configured as LCD_P11 */
    PORT_SetPinConfig(BOARD_LCD_12_PORT, BOARD_LCD_12_PIN, &LCD_12);

    const port_pin_config_t LCD_06 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P17 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTB21 (pin 67) is configured as LCD_P17 */
    PORT_SetPinConfig(BOARD_LCD_06_PORT, BOARD_LCD_06_PIN, &LCD_06);

    const port_pin_config_t LCD_04 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P18 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTB22 (pin 68) is configured as LCD_P18 */
    PORT_SetPinConfig(BOARD_LCD_04_PORT, BOARD_LCD_04_PIN, &LCD_04);

    const port_pin_config_t LCD_03 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P19 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTB23 (pin 69) is configured as LCD_P19 */
    PORT_SetPinConfig(BOARD_LCD_03_PORT, BOARD_LCD_03_PIN, &LCD_03);

    const port_pin_config_t LCD_07 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P7 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTB7 (pin 57) is configured as LCD_P7 */
    PORT_SetPinConfig(BOARD_LCD_07_PORT, BOARD_LCD_07_PIN, &LCD_07);

    const port_pin_config_t LCD_08 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P8 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTB8 (pin 58) is configured as LCD_P8 */
    PORT_SetPinConfig(BOARD_LCD_08_PORT, BOARD_LCD_08_PIN, &LCD_08);

