Masmiseim36/nxpSDK/boards/frdmkl46z/project_template/pin_mux.c
    const port_pin_config_t LCD_05 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P37 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTC17 (pin 91) is configured as LCD_P37 */
    PORT_SetPinConfig(BOARD_LCD_05_PORT, BOARD_LCD_05_PIN, &LCD_05);

    const port_pin_config_t LCD_10 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P38 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTC18 (pin 92) is configured as LCD_P38 */
    PORT_SetPinConfig(BOARD_LCD_10_PORT, BOARD_LCD_10_PIN, &LCD_10);

    const port_pin_config_t LCD_01 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P40 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTD0 (pin 93) is configured as LCD_P40 */
    PORT_SetPinConfig(BOARD_LCD_01_PORT, BOARD_LCD_01_PIN, &LCD_01);

    const port_pin_config_t LCD_02 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P52 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTE4 (pin 5) is configured as LCD_P52 */
    PORT_SetPinConfig(BOARD_LCD_02_PORT, BOARD_LCD_02_PIN, &LCD_02);

    const port_pin_config_t LCD_09 = {/* Internal pull-up/down resistor is disabled */
                                      kPORT_PullDisable,
                                      /* Slow slew rate is configured */
                                      kPORT_SlowSlewRate,
                                      /* Passive filter is disabled */
                                      kPORT_PassiveFilterDisable,
                                      /* Low drive strength is configured */
                                      kPORT_LowDriveStrength,
                                      /* Pin is configured as LCD_P53 */
                                      kPORT_PinDisabledOrAnalog};
    /* PORTE5 (pin 6) is configured as LCD_P53 */
    PORT_SetPinConfig(BOARD_LCD_09_PORT, BOARD_LCD_09_PIN, &LCD_09);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitOSC:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '51', peripheral: OSC0, signal: XTAL0, pin_signal: XTAL0/PTA19/UART1_TX/TPM_CLKIN1/LPTMR0_ALT1, slew_rate: no_init, pull_select: no_init, pull_enable: no_init}
  - {pin_num: '50', peripheral: OSC0, signal: EXTAL0, pin_signal: EXTAL0/PTA18/UART1_RX/TPM_CLKIN0, slew_rate: no_init, pull_select: no_init, pull_enable: no_init}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitOSC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitOSC(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA18 (pin 50) is configured as EXTAL0 */
    PORT_SetPinMux(BOARD_EXTAL0_PORT, BOARD_EXTAL0_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA19 (pin 51) is configured as XTAL0 */
    PORT_SetPinMux(BOARD_XTAL0_PORT, BOARD_XTAL0_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMAG:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '32', peripheral: I2C0, signal: SDA, pin_signal: PTE25/TPM0_CH1/I2C0_SDA, identifier: MAG_SDA, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '31', peripheral: I2C0, signal: SCL, pin_signal: PTE24/TPM0_CH0/I2C0_SCL, identifier: MAG_SCL, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '94', peripheral: GPIOD, signal: 'GPIO, 1', pin_signal: LCD_P41/ADC0_SE5b/PTD1/SPI0_SCK/TPM0_CH1/LCD_P41_Fault, identifier: MAG_INT2, direction: INPUT,
    slew_rate: fast, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

